[
  {
    "id": 5,
    "title": "Dark Mode - Enabled on iView/InfiniVIEW Webview",
    "date": "November 18, 2024",
    "time": "11:59 PM EST",
    "description": "Dark mode should work on the webview and APP.",
    "image": null,
    "link": null
  },
  {
    "id": 4,
    "title": "TikTok Ban Update",
    "date": "December 18, 2024",
    "time": "9:35 AM EST",
    "description": "The Supreme court of the united states agrees to hear tiktok's case",
    "image": null,
    "link": null
  },
  {
    "id": 3,
    "title": "Epic Rewards Starting On & After the 20th for DIP & LIVE FEST",
    "date": "December 18, 2024",
    "time": "11:43 AM EST",
    "description": "🎉 The following creators can expect epic rewards starting on & after the 20th for DIP & LIVE FEST\n\n🔥 bytesizebuzz\n🔥 canadiansweetheartxo\n🔥 deepthoughtsavailable\n🔥 destyneenathasia\n🔥 diazhated\n🔥 dr.real__\n🔥 ghostly.ghost5\n🔥 hollywoodchichi\n🔥 justbexo\n🔥 kenzie.taylor.01\n🔥 kimmmsyyyy\n🔥 kingtarot\n🔥 kristenrhodes8\n🔥 lakegirl_45\n🔥 nedunice09\n🔥 ni_kkie\n🔥 nikki.rosa1\n🔥 officialashleymichelle\n🔥 queenwidivybz\n🔥 relcoolin\n🔥 rotundaempire\n🔥 styles_1997\n🔥 tentlife69\n🔥 thegroundedtarot\n🔥 thinkz_noface\n\n✨ Congrats! ✨",
    "image": null,
    "link": null
  },
  {
    "id": 2,
    "title": "December: A Prime Opportunity to Increase Earnings for Infinitum LIVE Creators",
    "date": "December 13, 2024",
    "time": "11:03 AM EST",
    "description": "During December, U.S. audiences show unique viewing and gifting patterns. While activity briefly dips on Christmas Day, engagement rises before and after the holiday. This creates an ideal window for creators to boost their earnings. Key findings include:\n• Steady Creator Participation: Despite the holidays, the number of creators going LIVE remains constant, reflecting a committed creator base.\n• Enhanced Generosity: Average Revenue Per Paid User (ARPPU) grows by 5%, as gifters become more generous at year-end.\n• Increased Spending: User spending increases by 3% during the pre- and post-Christmas periods.\n• Growing Viewership: Viewer numbers rise by 7% outside of the holiday itself, expanding the potential audience.\n• Peak ARPPU During Christmas Week: Even though total activity peaks before and after Christmas, ARPPU is highest during the holiday week, allowing creators to earn more from fewer but more valuable gifters.\n\nAdvantage for Managed LIVE Creators on our network:\nManaged creators excel during this period:\n• They attract 8x more viewers per LIVE than non-managed creators, indicating superior content and engagement.\n• They achieve a 31% higher watch-to-paid conversion rate, converting more viewers into paying gifters.\n\nBy strategically scheduling sessions to match viewer demand, Infinitum LIVE creators can capitalize on these holiday trends. This approach leverages their inherent performance advantages, helping them maximize returns during December’s prime earning season.",
    "image": null,
    "link": null
  },
  {
    "id": 1,
    "title": "Stay calm about the TikTok ban—here's what you need to know",
    "date": "December 6, 2024",
    "time": "2:53 PM EST",
    "description": "The ban is not set to take effect until January 19, 2025.\nTikTok can still sell and divest from bytedance to stop the ban.\nTikTok still has over a month to file an appeal and potentially delay or overturn the decision.\nThe app will remain available for use; however, starting January 19, 2025, no new downloads or updates will be permitted. (If the ban is not appealed)\nWith the presidential transition on January 20, 2025, an executive order could potentially reverse the ban.",
    "image": null,
    "link": null
  }
]
